Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: The integer four, not to be confused with six, Tom's favorite editor.
es: El entero cuatro; no debe confundirse con seis, el editor favorito de Tom.

source: The interaction with the Perl compilation happens inside package C<myint>:
es: La interacción con la compilación de Perl tiene lugar dentro del paquete C<entero>:

source: The internal implementation uses the L<version> module to make sure that different types of version numbers are compared correctly.
es: La implementación interna usa el módulo L<version> para comprobar que los diferentes tipos de números de versión se comparan de forma correcta.

source: The interpretation of operations and values in Perl sometimes depends on the requirements of the context around the operation or value.
es: La interpretación de las operaciones y los valores en Perl depende a veces de las necesidades del contexto en el que se encuentra la operación o el valor.

source: The invocant can either be a class name or an object.
es: El autor de la llamada puede ser un nombre de clase o un objeto.

source: The item you want to look up.
es: El elemento que desea buscar.

source: The job is never done until the paperwork is over, so let's describe the change we've just made.
es: Para acabar el trabajo no queda más remedio que ocuparse del papeleo, así que vamos a describir el cambio que acabamos de hacer.

source: The joke is that it's scheduled for Christmas, but that we just don't know which one.
es: Decimos en broma que saldrá en Navidad, pero no confirmamos el año de lanzamiento.

source: The kind of computer you're working on, where one "kind" of computer means all those computers sharing a compatible machine language.
es: El tipo de equipo con el que se trabaja, donde "tipo de equipo" quiere decir todos los equipos con código máquina compatible.

source: The language is intended to be practical (easy to use, efficient, complete) rather than beautiful (tiny, elegant, minimal).
es: El lenguaje se diseñó para ser práctico (fácil de usar, eficaz, completo), más que estético (reducido, elegante, minimalista).

source: The largest repository of Perl mailing lists is located at L<http://lists.perl.org>.
es: El repositorio principal de listas de correo sobre Perl se encuentra en L<http://lists.perl.org>.

source: The last L</filehandle> that was designated with L<select|perlfunc/select>(C<FILEHANDLE>); L</STDOUT>, if no filehandle has been selected.
es: El último L</identificador de archivo> designado con L<select|perlfunc/select>(C<IDENTIFICADOR DE ARCHIVO>); si no se ha seleccionado ningún identificador de archivo, el canal de salida es L</STDOUT>.

source: The last rites performed by a parent L</process> on behalf of a deceased child process so that it doesn't remain a L</zombie>.
es: Los últimos rituales realizados por un L</proceso> primario en nombre de un proceso derivado fallecido para que no acabe convertido en un L</zombie>.

source: The last two would be the $0 and the $s variables in the (presumably) non-existent package C<who>.
es: Las dos últimas serían las variables $0 y $s del paquete C<usuario>, que probablemente no exista.

source: The latest versions are probably the least deployed and widely tested, so you may want to wait a few months after their release and see what problems others have if you are risk averse.
es: Las versiones más recientes suelen estar menos implementadas y probadas. Si no le gusta arriesgar, es posible que prefiera esperar unos meses para ver qué problemas detectan los usuarios.

source: The latest versions of perl have more bug fixes.
es: Las versiones más recientes de perl incorporan más correcciones de errores.

source: The left hand side of the method invocation (or arrow) operator is the object (or class name), and the right hand side is the method name.
es: La parte situada a la izquierda del operador de invocación de método (flecha) es el objeto (o nombre de clase) y la parte situada a la derecha es el nombre del método.

source: The length of an array is a scalar value.
es: El número de elementos (que llamaremos "longitud") de un array es un valor escalar.

source: The level at which you pitch it is up to you: you might want protocol-level modules analogous to L<Net::SMTP|Net::SMTP> which then talk to higher level modules analogous to L<Mail::Send|Mail::Send>.
es: El nivel al que desee afrontar la tarea es cosa suya: puede que desee crear módulos de nivel de protocolo análogos a L<Net::SMTP|Net::SMTP> para comunicarse con módulos de nivel superior análogos a L<Mail::Send|Mail::Send>.

source: The list C<1,,3> is a concatenation of two lists, C<1,> and C<3>, the first of which ends with that optional comma.
es: La lista C<1,,3> es una concatenación de dos listas, C<1,> y C<3>, la primera de las cuales termina con una coma opcional.

source: The list assignment in scalar context will translate that into the number of elements (here, the number of times the pattern matched) and assign that to $count.
es: La asignación de lista en contexto de escalar se traducirá en el número de elementos (en este caso, el número de veces que se detecta el patrón), que se asignará a $recuento.

source: The list is stored as one of your L<environment variables|/environment variable>, accessible in Perl as C<$ENV{PATH}>.
es: La lista se almacena como una de las L<variables de entorno|/variable de entorno>, a la que se accede en Perl a través de C<$ENV{PATH}>.

source: The list of L<directories|/directory> the system searches to find a program you want to L</execute>.
es: Lista de L<directorios|/directorio> en los que el sistema busca el programa que el usuario desea L</ejecutar>.

source: The little number the L</operating system> uses to keep track of which opened L</file> you're talking about.
es: El número que el L</sistema operativo> usa para controlar a qué L</archivo> abierto se refiere.

source: The locale used will be the one in effect at the time of execution of the pattern match.
es: La configuración regional usada será la que esté vigente en el momento de ejecutar la detección de coincidencias de patrón.

source: The loose sense can be used at varying levels of specificity.
es: Este sentido informal se puede usar con varios niveles de especificidad.

source: The lower-level loops are I<interrupted> (that is, the loop is broken) when Perl detects that a repeated expression matched a zero-length substring.
es: Los bucles de bajo nivel se I<interrumpen> (es decir, se sale del bucle) cuando Perl detecta que una expresión repetida coincide con una subcadena de longitud cero.

source: The main interface to Perl's documentation is C<perldoc>, although if you're reading this, it's more than likely that you've already found it.
es: Como ya sabe, la interfaz principal de la documentación de Perl es C<perldoc>.

source: The main problem with multiple inheritance is that it greatly complicates method resolution.
es: El problema de la herencia múltiple es que complica enormemente la resolución de métodos.

source: The main program file and each module it loads are compilation units, as are string C<eval>s, code compiled using the C<(?{ })> construct in a regex, calls to C<do FILE>, C<require FILE>, and code after the C<-e> switch on the command line.
es: El archivo del programa principal y cada módulo que carga son unidades de compilación, como lo son las funciones C<eval> de cadena, el código compilado con la construcción C<(?{ })> en una expresión regular, las llamadas a C<do ARCHIVO>, C<require ARCHIVO> y el código que haya a continuación del modificador C<-e> en la línea de comandos.

source: The main symbol table's name is thus C<%main::>, or C<%::> for short.
es: Así, el nombre de la tabla de símbolos de C<main> es C<%main::>, y se puede abreviar como C<%::>.

source: The main use of typeglobs in modern Perl is create symbol table aliases.
es: El uso principal de los typeglobs en Perl moderno es crear alias en la tabla de símbolos.

source: The main way they do this is by abstracting the solution into a Perl module.
es: La forma principal de compartir código es abstraer la solución en un módulo Perl.

source: The maintenance versions are stable, and have an even number as the minor release (i.e. perl5.10.x, where 10 is the minor release).
es: Las versiones de mantenimiento son estables; en estas versiones se utiliza un número par como número de versión secundaria (p.ej., perl5.10.x, donde 10 es el número de versión secundaria).

source: The major reference book on Perl, written by the creator of Perl, is I<Programming Perl>:
es: El principal libro de referencia sobre Perl, escrito por el creador del lenguaje, es I<Programming Perl>:

source: The markup used to embed documentation into your Perl code.
es: Lenguaje de marcado que se usa para incrustar documentación en código Perl.

source: The master web site for CPAN is L<http://www.cpan.org/>, L<http://www.cpan.org/SITES.html> lists all mirrors.
es: El sitio web principal de CPAN está en L<http://www.cpan.org/>. En L<http://www.cpan.org/SITES.html> encontrará una lista de todos los servidores reflejados.

source: The maximum depth is compiled into perl, so changing it requires a custom build.
es: La profundidad máxima está compilada en perl, por lo que su modificación requiere una compilación personalizada.

source: The metaconfig system has its own git repository.
es: El sistema metaconfig tiene su propio repositorio git.

source: The methods associated with a file might include C<rename()> and C<write()>.
es: Los métodos asociados a un archivo podrían incluir C<renombrar()> y C<escribir()>.

source: The minimal implementation of the package C<MyMaths> would be something like this:
es: Una implementación mínima del paquete C<MisOperadores> podría ser:

source: The modern convention for OO modules is to always use C<new> as the name for the constructor, but there is no requirement to do so.
es: El convenio actual en los módulos orientados a objetos es usar siempre C<new> como nombre para el constructor, aunque esto no es obligatorio.

source: The modifiers C</imsxadlup> may also be embedded within the regular expression itself using the C<(?...)> construct, see L</Extended Patterns> below.
es: Estos modificadores C</imsxadlup> también se pueden incrustar dentro de la propia expresión regular mediante la construcción C<(?...)>. Vea L</Patrones extendidos> más abajo.

source: The most common git command you will use will probably be
es: El comando de git que usará con más frecuencia probablemente sea

source: The most important attribute of a socket, like your telephone's telephone number.
es: El atributo más importante de un socket (equivalente al número de un teléfono).

source: The most important thing about a socket is its L</network address> (like a phone number).
es: La característica más importante de un socket es su L</dirección de red> (es como un número de teléfono).

source: The most important thing is to run your programs under the B<-w> flag at all times.
es: Lo más importante es ejecutar siempre los programas con la opción B<-w>.

source: The most well known of these is C<%ENV> which contains environment variables.
es: El más conocido es C<%ENV>, que contiene variables de entorno.

source: The movement of bits left or right in a computer word, which has the effect of multiplying or dividing by a power of 2.
es: Movimiento de bits hacia la izquierda o la derecha en una palabra de procesador, lo que tiene el efecto de multiplicar o dividir por una potencia de 2.

source: The name C<new> isn't special.
es: El nombre C<new> no es especial.

source: The name has stuck.
es: El nombre quedó incorporado al acervo cultural de la comunidad.

source: The name of the C<(*SKIP:NAME)> pattern has special significance.
es: El nombre del patrón C<(*SKIP:NOMBRE)> tiene un significado especial.

source: The name of the array containing the L</argument> L</vector> from the command line.
es: Nombre del array que contiene el L</vector> de L<argumentos|/argumento> de la línea de comandos.

source: The name of the program currently executing, as typed on the command line.
es: El nombre del programa que se está ejecutando actualmente, tal como se escribió en la línea de comandos.

source: The names of the classes should be the result of calling C<HvENAME()> on the stash.
es: Los nombres de las clases deben ser el resultado de llamar a C<HvENAME()> en el hash de tabla de símbolos.

source: The notation is C<(?E<lt>I<name>E<gt>...)> to declare and C<\g{I<name>}> to reference.
es: Se usa la notación C<(?E<lt>I<nombre>E<gt>...)> para declarar el grupo y C<\g{I<nombre>}> para hacer referencia al mismo.

source: The notion that there can be more than one valid path to solving a programming problem in context.
es: La noción de que puede haber más de una forma válida de solucionar un problema de programación en un contexto determinado.

source: The notion that an empty L</derived class> should behave exactly like its L</base class>.
es: La noción de que una L</clase derivada> vacía debe comportarse exactamente igual que su L</clase base>.

source: The notion that you can tell an L</object> to do something generic, and the object will interpret the command in different ways depending on its type.
es: La noción de que se puede decir a un L</objeto> que haga algo genérico y este interpretará el comando de distinta manera en función de su tipo.

source: The notion that, with a complete set of simple tools that work well together, you can build almost anything you want.
es: La noción de que basta un conjunto completo de herramientas sencillas que funcionan bien juntas para construir todo lo que se desee.

source: The null list contains no elements, so when the password file is exhausted, the result is 0, not 2.
es: La lista vacía no contiene elementos, así que cuando se acaba el archivo de contraseñas, el resultado es 0, no 2.

source: The null list is represented by ().
es: La lista nula se representa por ().

source: The number after Perl (i.e. the 5 after Perl 5) is the major release of the perl interpreter as well as the version of the language.
es: El número que va detrás de Perl (el 5 de Perl 5) es la versión principal del intérprete de Perl (es decir, perl), así como la versión del lenguaje.

source: The number of characters is no longer known, because characters only exist in text strings.
es: Ya no se podrá saber cuál es el número de caracteres, puesto que los caracteres solo existen en las cadenas de texto.

source: The number of lines read previous to this one, plus 1.
es: El número de líneas leídas antes que esta más 1.

source: The numbering within each branch will be as normal, and any groups following this construct will be numbered as though the construct contained only one branch, that being the one with the most capture groups in it.
es: La numeración dentro de cada rama será la normal, y cualquier grupo después de esta construcción se numerará como si la construcción contuviera una sola rama, que es la que contiene más grupos de captura.

source: The numbers underneath show in which group the captured content will be stored.
es: Los números de abajo muestran en qué grupo se almacenará el contenido capturado.

source: The object systems that we recommend below all automate the generation of accessor methods.
es: Los sistemas de orientación a objetos que se recomiendan a continuación automatizan la generación de los métodos de acceso.

source: The old "gnu-0.2" binary distribution will most certainly have additional problems.
es: Con toda seguridad habrá más problemas en la distribución binaria anterior, "gnu-0.2".

source: The old home for the module tests, you shouldn't put anything new in here.
es: Antiguo directorio de las pruebas de módulos. No debe colocar nada aquí.

source: The old package delimiter was a single quote, but double colon is now the preferred delimiter, in part because it's more readable to humans, and in part because it's more readable to B<emacs> macros.
es: Anteriormente, el delimitador de paquete era una simple comilla, pero ahora se usa un doble signo de dos puntos, en parte porque es más legible para los humanos y también porque es más legible para las macros de B<emacs>.

source: The one that was stuffed away by C<local()> and which will be restored when the block ends.
es: la que fue reemplazada por C<local()> y que será restaurada cuando finalice el bloque.

source: The one user (apart from the superuser) who has absolute control over a L</file>.
es: El usuario (aparte del superusuario) que tiene el control absoluto sobre un L</archivo>.

source: The only difference between them is the place that the filter is installed.
es: La única diferencia entre ellos es el lugar en el que se instala el filtro.

source: The only difference is that you're now using characters instead of bytes.
es: La única diferencia es que ahora trabajamos con caracteres en lugar de bytes.

source: The only implication of the term "native" on integers is that the limits for the maximal and the minimal supported true integral quantities are close to powers of 2.
es: La única implicación del término "nativo" para los enteros es que los límites máximo y mínimo de las cantidades verdaderamente enteras admitidas son cercanos a potencias de 2.

source: The only one you need to know about for now is C<$_> which is the "default variable".
es: La única que tiene que conocer por ahora es C<$_>, la "variable predeterminada".

source: The only parameter that you can pass to C<has> is C<is>.
es: El único parámetro que puede pasar a C<has> es C<is>.

source: The only types of updates allowed on these branches are "fast-forward's", where all history is preserved.
es: Los únicos tipos de actualización que se permiten en estas ramas son los de "avance rápido", que conservan el historial.

source: The only way you will ever be allowed to rebase or modify the history of a pushed branch is to delete it and push it as a new branch under the same name.
es: La única manera de reorganizar o modificar el historial de una rama enviada es eliminarla y enviarla como una rama nueva con el mismo nombre.

source: The operating system knows your current directory because you told it with a L<chdir|perlfunc/chdir> or because you started out in the place where your parent L</process> was when you were born.
es: El sistema operativo sabe cuál es el directorio actual porque se lo ha comunicado mediante la función L<chdir|perlfunc/chdir> o porque empezó en el lugar en el que nació el L</proceso> primario.

source: The operation of interpolation should not be confused with the operation of matching a backreference.
es: La operación de interpolación no se debe confundir con la operación de coincidencia con una retrorreferencia.

source: The optree is shared between threads.
es: El árbol sintáctico de operaciones se comparte entre hilos de ejecución.

source: The order in which objects are destroyed during the global destruction before the program exits is unpredictable.
es: El orden en que se destruyen los objetos durante la destrucción global antes de que finalice la ejecución del programa no se puede predecir.

source: The order into which L<characters|/character> sort.
es: Orden en que se ordenan los L<caracteres|/carácter>.

source: The ordering is the same as for the regular expression which is the result of EXPR, or the pattern contained by capture group PARNO.
es: El orden es el mismo que para la expresión regular que sea el resultado de EXPR o el patrón capturado en el grupo de captura PARNO.

source: The ordering of the matches is the same as for the chosen subexpression.
es: El orden de las coincidencias es el mismo que para la subexpresión seleccionada.

source: The ordinal value of a character is called a B<code point>.
es: El valor ordinal de un carácter se denomina B<código de carácter> (I<code point>).

source: The original culture of the pre-populist Internet and the deeply-held beliefs of Perl's author, Larry Wall, gave rise to the free and open distribution policy of perl.
es: La cultura de Internet existente antes de que "la red" se convirtiera en un fenómeno de masas, y las firmes convicciones de Larry Wall, el creador de Perl, dieron lugar a la política de distribución libre y abierta de perl.

source: The other difference is that seeing the first C<require> clues in the compiler that uses of indirect object notation involving "SomeModule", as in C<$ob = purge SomeModule>, are method calls, not function calls.
es: La otra diferencia consiste en que C<require> indica al compilador que se usa la sintaxis indirecta de objetos en relación a "MiModulo", de forma que las expresiones del estilo C<$ob = purge MiModulo> indican llamadas a métodos y no llamadas a funciones.

source: The package statement declares the compilation unit as being in the given namespace.
es: La instrucción C<package> declara que la unidad de compilación está en el espacio de nombres especificado.

source: The package variable C<@EXPORT> will determine which symbols will get exported when the caller simply says C<use Net::Acme> - you will hardly ever want to put anything in there.
es: La variable de paquete C<@EXPORT> determina qué símbolos se exportan cuando en el código que llama solo se usa C<use Net::Acme>. Es muy probable que nunca tenga que colocar nada aquí.

source: The part of the address of a TCP or UDP socket that directs packets to the correct process after finding the right machine, something like the phone extension you give when you reach the company operator.
es: La parte de la dirección de un socket TCP o UDP que dirige los paquetes al proceso correcto tras localizar el equipo correcto. Es como la extensión telefónica que se teclea tras marcar el número.

source: The pattern really, I<really> wants to succeed, so it uses the standard pattern back-off-and-retry and lets C<\D*> expand to just "AB" this time.
es: El patrón realmente I<quiere> coincidir, por lo que utiliza el modelo estándar de volver atrás y reintentar, y deja que C<\D*> se expanda esta vez a solo "AB".

source: The patterns used in Perl pattern matching evolved from those supplied in the Version 8 regex routines.
es: Los patrones usados en el sistema de detección de coincidencias de Perl evolucionaron a partir de los suministrados por la versión 8 de las rutinas de expresiones regulares.

source: The period at the end of this sentence is a terminator.
es: El punto al final de esta frase es un terminador.

source: The perl history contains one mistake which was not caught in the conversion: a merge was recorded in the history between blead and maint-5.10 where no merge actually occurred.
es: El historial de perl contiene un error que no se detectó en la conversión: se registró en el historial una combinación entre blead y maint-5.10 que en realidad no tuvo lugar.

source: The person whom the L</operating system> will let do almost anything.
es: La persona a la que el L</sistema operativo> deja hacer casi todo.

source: The position of a character in a character set encoding.
es: La posición de un carácter en la codificación de un conjunto de caracteres.

source: The practice of saying, "If I had to do it all over, I'd do it differently," and then actually going back and doing it all over differently.
es: La práctica de decir "Si pudiera volver a empezar, lo haría todo de otra manera", y después volver atrás y hacer las cosas de manera diferente.
